Revit 2027 API
AnalysisDisplayStyle.GetColoredSurfaceSettings Method
 Get colored surface settings object from the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayColoredSurfaceSettings GetColoredSurfaceSettings()
Public Function GetColoredSurfaceSettings As AnalysisDisplayColoredSurfaceSettings
public:
AnalysisDisplayColoredSurfaceSettings^ GetColoredSurfaceSettings()
member GetColoredSurfaceSettings : unit -> AnalysisDisplayColoredSurfaceSettings
Return Value
AnalysisDisplayColoredSurfaceSettings
Exceptions
Exception | Condition
InvalidOperationException |  colored surface settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace